[Killed] BlockStatement
src/arry/arry.ts:1:74
-export function isArrayOfStrings<T extends string[]>(params: T): boolean {
-  if (typeof params !== 'object') {
-    return false
-  }
-  if (!Array.isArray(params)) {
-    return false
-  }
-  return params.every((param) => typeof param === 'string')
-}
+export function isArrayOfStrings<T extends string[]>(params: T): boolean {}
 export function orderbyLongitude(words: string[]): string[] {
   let orderWrods: string[] = []
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected [] to strictly equal [ 'camote' ]

[Killed] ConditionalExpression
src/arry/arry.ts:2:7
 export function isArrayOfStrings<T extends string[]>(params: T): boolean {
-  if (typeof params !== 'object') {
+  if (true) {
     return false
   }
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected [] to strictly equal [ 'camote' ]

[Killed] EqualityOperator
src/arry/arry.ts:2:7
 export function isArrayOfStrings<T extends string[]>(params: T): boolean {
-  if (typeof params !== 'object') {
+  if (typeof params === 'object') {
     return false
   }
killedBy: isArrayOfStrings isArrayOfStrings(["apple", "grape", "banana", "orange"]) should be true
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/arry/arry.ts:3:12
 export function isArrayOfStrings<T extends string[]>(params: T): boolean {
   if (typeof params !== 'object') {
-    return false
+    return true
   }
   if (!Array.isArray(params)) {
killedBy: isArrayOfStrings isArrayOfStrings(50) should be false
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/arry/arry.ts:5:31
   if (typeof params !== 'object') {
     return false
   }
-  if (!Array.isArray(params)) {
-    return false
-  }
+  if (!Array.isArray(params)) {}
   return params.every((param) => typeof param === 'string')
 }
killedBy: isArrayOfStrings isArrayOfStrings({}) should be false
statusReason: params.every is not a function

[Killed] ConditionalExpression
src/arry/arry.ts:5:7
   if (typeof params !== 'object') {
     return false
   }
-  if (!Array.isArray(params)) {
+  if (false) {
     return false
   }
killedBy: isArrayOfStrings isArrayOfStrings({}) should be false
statusReason: params.every is not a function

[Killed] BooleanLiteral
src/arry/arry.ts:6:12
     return false
   }
   if (!Array.isArray(params)) {
-    return false
+    return true
   }
   return params.every((param) => typeof param === 'string')
killedBy: isArrayOfStrings isArrayOfStrings({}) should be false
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/arry/arry.ts:8:10
   if (!Array.isArray(params)) {
     return false
   }
-  return params.every((param) => typeof param === 'string')
+  return params.some(param => typeof param === 'string')
 }
 export function orderbyLongitude(words: string[]): string[] {
killedBy: isArrayOfStrings isArrayOfStrings([]) should be true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/arry/arry.ts:8:34
   if (!Array.isArray(params)) {
     return false
   }
-  return params.every((param) => typeof param === 'string')
+  return params.every((param) => false)
 }
 export function orderbyLongitude(words: string[]): string[] {
killedBy: isArrayOfStrings isArrayOfStrings(["apple", "grape", "banana", "orange"]) should be true
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/arry/arry.ts:10:61
   }
   return params.every((param) => typeof param === 'string')
 }
-export function orderbyLongitude(words: string[]): string[] {
-  let orderWrods: string[] = []
-  if (isArrayOfStrings(words)) {
-    orderWrods = words.sort()
-  } else {
-    orderWrods = []
-  }
-  return orderWrods
-}
+export function orderbyLongitude(words: string[]): string[] {}
 export function takeOut(words: string[], removed: string): string[] {
   let orderWords: string[] = []
killedBy: orderbyLongitude orderbyLongitude(["apple", "banana"]) should be ["apple", "grape", "banana", "orange"]
statusReason: expected undefined to strictly equal [ 'apple', 'banana' ]

[Killed] ConditionalExpression
src/arry/arry.ts:12:7
 }
 export function orderbyLongitude(words: string[]): string[] {
   let orderWrods: string[] = []
-  if (isArrayOfStrings(words)) {
+  if (false) {
     orderWrods = words.sort()
   } else {
killedBy: orderbyLongitude orderbyLongitude(["apple", "banana"]) should be ["apple", "grape", "banana", "orange"]
statusReason: expected [] to strictly equal [ 'apple', 'banana' ]

[Killed] BlockStatement
src/arry/arry.ts:12:32
 }
 export function orderbyLongitude(words: string[]): string[] {
   let orderWrods: string[] = []
-  if (isArrayOfStrings(words)) {
-    orderWrods = words.sort()
-  } else {
+  if (isArrayOfStrings(words)) {} else {
     orderWrods = []
   }
killedBy: orderbyLongitude orderbyLongitude(["apple", "banana"]) should be ["apple", "grape", "banana", "orange"]
statusReason: expected [] to strictly equal [ 'apple', 'banana' ]

[Killed] MethodExpression
src/arry/arry.ts:13:18
 export function orderbyLongitude(words: string[]): string[] {
   let orderWrods: string[] = []
   if (isArrayOfStrings(words)) {
-    orderWrods = words.sort()
+    orderWrods = words
   } else {
     orderWrods = []
killedBy: orderbyLongitude orderbyLongitude(["apple", "banana"]) should be ["apple", "grape", "banana", "orange"]
statusReason: expected [ 'banana', 'apple' ] to strictly equal [ 'apple', 'banana' ]

[NoCoverage] BlockStatement
src/arry/arry.ts:14:10
   let orderWrods: string[] = []
   if (isArrayOfStrings(words)) {
     orderWrods = words.sort()
-  } else {
-    orderWrods = []
-  }
+  } else {}
   return orderWrods
 }

[Killed] BlockStatement
src/arry/arry.ts:19:69
   }
   return orderWrods
 }
-export function takeOut(words: string[], removed: string): string[] {
-  let orderWords: string[] = []
-  if (isArrayOfStrings(words) && typeof removed === 'string') {
-    const index = words.indexOf(removed)
-    if (index !== -1) {
-      orderWords = words.filter((_, i) => i !== index)
-    } else {
-      orderWords = words.slice()
-    }
-    return orderWords
-  } else {
-    return (orderWords = [])
-  }
-}
+export function takeOut(words: string[], removed: string): string[] {}
 export function getParams(words: string[], get: string): boolean {
   if (isArrayOfStrings(words) && typeof get === 'string') {
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected undefined to strictly equal [ 'camote' ]

[Killed] EqualityOperator
src/arry/arry.ts:21:34
 }
 export function takeOut(words: string[], removed: string): string[] {
   let orderWords: string[] = []
-  if (isArrayOfStrings(words) && typeof removed === 'string') {
+  if (isArrayOfStrings(words) && typeof removed !== 'string') {
     const index = words.indexOf(removed)
     if (index !== -1) {
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected [] to strictly equal [ 'camote' ]

[Killed] ConditionalExpression
src/arry/arry.ts:21:34
 }
 export function takeOut(words: string[], removed: string): string[] {
   let orderWords: string[] = []
-  if (isArrayOfStrings(words) && typeof removed === 'string') {
+  if (isArrayOfStrings(words) && true) {
     const index = words.indexOf(removed)
     if (index !== -1) {
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected [ 'papa', 'camote' ] to strictly equal []

[Killed] ConditionalExpression
src/arry/arry.ts:23:9
   let orderWords: string[] = []
   if (isArrayOfStrings(words) && typeof removed === 'string') {
     const index = words.indexOf(removed)
-    if (index !== -1) {
+    if (false) {
       orderWords = words.filter((_, i) => i !== index)
     } else {
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected [ 'papa', 'camote' ] to strictly equal [ 'camote' ]

[Killed] BlockStatement
src/arry/arry.ts:23:23
   let orderWords: string[] = []
   if (isArrayOfStrings(words) && typeof removed === 'string') {
     const index = words.indexOf(removed)
-    if (index !== -1) {
-      orderWords = words.filter((_, i) => i !== index)
-    } else {
+    if (index !== -1) {} else {
       orderWords = words.slice()
     }
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected [] to strictly equal [ 'camote' ]

[Killed] ConditionalExpression
src/arry/arry.ts:24:43
   if (isArrayOfStrings(words) && typeof removed === 'string') {
     const index = words.indexOf(removed)
     if (index !== -1) {
-      orderWords = words.filter((_, i) => i !== index)
+      orderWords = words.filter((_, i) => false)
     } else {
       orderWords = words.slice()
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected [] to strictly equal [ 'camote' ]

[Killed] MethodExpression
src/arry/arry.ts:24:20
   if (isArrayOfStrings(words) && typeof removed === 'string') {
     const index = words.indexOf(removed)
     if (index !== -1) {
-      orderWords = words.filter((_, i) => i !== index)
+      orderWords = words
     } else {
       orderWords = words.slice()
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected [ 'papa', 'camote' ] to strictly equal [ 'camote' ]

[Killed] BlockStatement
src/arry/arry.ts:25:12
     const index = words.indexOf(removed)
     if (index !== -1) {
       orderWords = words.filter((_, i) => i !== index)
-    } else {
-      orderWords = words.slice()
-    }
+    } else {}
     return orderWords
   } else {
killedBy: takeOut takeOut([`papa`,`camote`],papa) Returns [`papa`]
statusReason: expected [] to strictly equal [ 'papa', 'camote' ]

[Survived] MethodExpression
src/arry/arry.ts:26:20
     if (index !== -1) {
       orderWords = words.filter((_, i) => i !== index)
     } else {
-      orderWords = words.slice()
+      orderWords = words
     }
     return orderWords

[Killed] BlockStatement
src/arry/arry.ts:29:10
       orderWords = words.slice()
     }
     return orderWords
-  } else {
-    return (orderWords = [])
-  }
+  } else {}
 }
 export function getParams(words: string[], get: string): boolean {
killedBy: takeOut takeOut([1, 23],1) Returns []
statusReason: expected undefined to strictly equal []

[Killed] ArrayDeclaration
src/arry/arry.ts:30:26
     }
     return orderWords
   } else {
-    return (orderWords = [])
+    return (orderWords = ["Stryker was here"])
   }
 }
killedBy: takeOut takeOut([1, 23],1) Returns []
statusReason: expected [ 'Stryker was here' ] to strictly equal []

[Killed] BlockStatement
src/arry/arry.ts:33:66
     return (orderWords = [])
   }
 }
-export function getParams(words: string[], get: string): boolean {
-  if (isArrayOfStrings(words) && typeof get === 'string') {
-    for (let i = 0; i < words.length; i++) {
-      if (words[i] === get) {
-        return true
-      }
-    }
-    return false
-  } else {
-    return false
-  }
-}
+export function getParams(words: string[], get: string): boolean {}
 
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/arry/arry.ts:34:7
   }
 }
 export function getParams(words: string[], get: string): boolean {
-  if (isArrayOfStrings(words) && typeof get === 'string') {
+  if (false) {
     for (let i = 0; i < words.length; i++) {
       if (words[i] === get) {
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/arry/arry.ts:34:34
   }
 }
 export function getParams(words: string[], get: string): boolean {
-  if (isArrayOfStrings(words) && typeof get === 'string') {
+  if (isArrayOfStrings(words) && typeof get !== 'string') {
     for (let i = 0; i < words.length; i++) {
       if (words[i] === get) {
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/arry/arry.ts:35:21
 }
 export function getParams(words: string[], get: string): boolean {
   if (isArrayOfStrings(words) && typeof get === 'string') {
-    for (let i = 0; i < words.length; i++) {
+    for (let i = 0; false; i++) {
       if (words[i] === get) {
         return true
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/arry/arry.ts:35:44
 }
 export function getParams(words: string[], get: string): boolean {
   if (isArrayOfStrings(words) && typeof get === 'string') {
-    for (let i = 0; i < words.length; i++) {
-      if (words[i] === get) {
-        return true
-      }
-    }
+    for (let i = 0; i < words.length; i++) {}
     return false
   } else {
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/arry/arry.ts:36:11
 export function getParams(words: string[], get: string): boolean {
   if (isArrayOfStrings(words) && typeof get === 'string') {
     for (let i = 0; i < words.length; i++) {
-      if (words[i] === get) {
+      if (false) {
         return true
       }
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/arry/arry.ts:36:29
 export function getParams(words: string[], get: string): boolean {
   if (isArrayOfStrings(words) && typeof get === 'string') {
     for (let i = 0; i < words.length; i++) {
-      if (words[i] === get) {
-        return true
-      }
+      if (words[i] === get) {}
     }
     return false
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/arry/arry.ts:37:16
   if (isArrayOfStrings(words) && typeof get === 'string') {
     for (let i = 0; i < words.length; i++) {
       if (words[i] === get) {
-        return true
+        return false
       }
     }
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/arry/arry.ts:41:10
       }
     }
     return false
-  } else {
-    return false
-  }
+  } else {}
 }
 
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/arry/arry.ts:42:12
     }
     return false
   } else {
-    return false
+    return true
   }
 }
killedBy: getParams get([`papa`,`banana`],`papa`)
statusReason: expected true to be false // Object.is equality
