[Killed] BlockStatement
src/object/equalityBetwenn.ts:4:30
 export function equalityBetwenn<
   T extends Record<string, unknown>,
   V extends Record<string, unknown>
->(obj1: T, obj2: V): boolean {
-  if (typeof obj1 !== 'object' || typeof obj2 !== 'object') {
-    return false
-  }
-
-  const keys1 = Object.keys(obj1)
-  const keys2 = Object.keys(obj2)
-  if (keys1.length !== keys2.length) {
-    return false
-  }
-
-  for (const key of keys1) {
-    if (obj1[key] !== obj2[key]) {
-      return false
-    }
-  }
-
-  return true
-}
+>(obj1: T, obj2: V): boolean {}
 type AnyObject = Record<string, unknown>
 
killedBy: equalityBetwenn equalityBetwenn({},{}) retunr true
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/object/equalityBetwenn.ts:5:61
   T extends Record<string, unknown>,
   V extends Record<string, unknown>
 >(obj1: T, obj2: V): boolean {
-  if (typeof obj1 !== 'object' || typeof obj2 !== 'object') {
-    return false
-  }
+  if (typeof obj1 !== 'object' || typeof obj2 !== 'object') {}
 
   const keys1 = Object.keys(obj1)
killedBy: equalityBetwenn equalityBetwenn(10,2) retunr false
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/object/equalityBetwenn.ts:5:7
   T extends Record<string, unknown>,
   V extends Record<string, unknown>
 >(obj1: T, obj2: V): boolean {
-  if (typeof obj1 !== 'object' || typeof obj2 !== 'object') {
+  if (typeof obj1 !== 'object' && typeof obj2 !== 'object') {
     return false
   }
killedBy: equalityBetwenn equalityBetwenn(10,2) retunr false
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/object/equalityBetwenn.ts:6:12
   V extends Record<string, unknown>
 >(obj1: T, obj2: V): boolean {
   if (typeof obj1 !== 'object' || typeof obj2 !== 'object') {
-    return false
+    return true
   }
 
killedBy: equalityBetwenn equalityBetwenn(10,2) retunr false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/object/equalityBetwenn.ts:11:7
 
   const keys1 = Object.keys(obj1)
   const keys2 = Object.keys(obj2)
-  if (keys1.length !== keys2.length) {
+  if (keys1.length === keys2.length) {
     return false
   }
killedBy: equalityBetwenn equalityBetwenn({},{}) retunr true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/object/equalityBetwenn.ts:11:7
 
   const keys1 = Object.keys(obj1)
   const keys2 = Object.keys(obj2)
-  if (keys1.length !== keys2.length) {
+  if (true) {
     return false
   }
killedBy: equalityBetwenn equalityBetwenn({},{}) retunr true
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/object/equalityBetwenn.ts:12:12
   const keys1 = Object.keys(obj1)
   const keys2 = Object.keys(obj2)
   if (keys1.length !== keys2.length) {
-    return false
+    return true
   }
 
killedBy: equalityBetwenn should sum every single number by the given accesor
statusReason: expected true to be false // Object.is equality

[Survived] BlockStatement
src/object/equalityBetwenn.ts:15:28
     return false
   }
 
-  for (const key of keys1) {
-    if (obj1[key] !== obj2[key]) {
-      return false
-    }
-  }
+  for (const key of keys1) {}
 
   return true

[Killed] EqualityOperator
src/object/equalityBetwenn.ts:16:9
   }
 
   for (const key of keys1) {
-    if (obj1[key] !== obj2[key]) {
+    if (obj1[key] === obj2[key]) {
       return false
     }
killedBy: equalityBetwenn should sum every single number by the given accesor
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/object/equalityBetwenn.ts:16:9
   }
 
   for (const key of keys1) {
-    if (obj1[key] !== obj2[key]) {
+    if (true) {
       return false
     }
killedBy: equalityBetwenn should sum every single number by the given accesor
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/object/equalityBetwenn.ts:17:14
 
   for (const key of keys1) {
     if (obj1[key] !== obj2[key]) {
-      return false
+      return true
     }
   }

[Killed] BooleanLiteral
src/object/equalityBetwenn.ts:21:10
     }
   }
 
-  return true
+  return false
 }
 type AnyObject = Record<string, unknown>
killedBy: equalityBetwenn equalityBetwenn({},{}) retunr true
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/object/equalityBetwenn.ts:25:67
 }
 type AnyObject = Record<string, unknown>
 
-export function Combine(obj1: AnyObject, obj2: AnyObject): object {
-  let combined: object[] = []
-
-  if (typeof obj1 === 'object' && typeof obj2 === 'object') {
-    return (combined = [...obj1, ...obj2])
-  } else {
-    return combined
-  }
-}
+export function Combine(obj1: AnyObject, obj2: AnyObject): object {}
 
killedBy: Convinar should sum every single number by the given accesor
statusReason: expected undefined to strictly equal [ Array(4) ]

[Killed] ConditionalExpression
src/object/equalityBetwenn.ts:28:35
 export function Combine(obj1: AnyObject, obj2: AnyObject): object {
   let combined: object[] = []
 
-  if (typeof obj1 === 'object' && typeof obj2 === 'object') {
+  if (typeof obj1 === 'object' && true) {
     return (combined = [...obj1, ...obj2])
   } else {
killedBy: Convinar equalityBetwenn(10,2) retunr false
statusReason: obj1 is not iterable

[Killed] EqualityOperator
src/object/equalityBetwenn.ts:28:7
 export function Combine(obj1: AnyObject, obj2: AnyObject): object {
   let combined: object[] = []
 
-  if (typeof obj1 === 'object' && typeof obj2 === 'object') {
+  if (typeof obj1 !== 'object' && typeof obj2 === 'object') {
     return (combined = [...obj1, ...obj2])
   } else {
killedBy: Convinar should sum every single number by the given accesor
statusReason: expected [] to strictly equal [ Array(4) ]

[Killed] BlockStatement
src/object/equalityBetwenn.ts:30:10
 
   if (typeof obj1 === 'object' && typeof obj2 === 'object') {
     return (combined = [...obj1, ...obj2])
-  } else {
-    return combined
-  }
+  } else {}
 }
 
killedBy: Convinar equalityBetwenn(10,2) retunr false
statusReason: expected undefined to strictly equal []
