[Killed] BlockStatement
src/string/capitarLater.ts:1:52
-export function capitalLater(word: string): string {
-  if (typeof word === 'string') {
-    const splittedString = word.split(' ')
-    return splittedString
-      .map((str: string) => {
-        return str.charAt(0).toUpperCase() + str.slice(1).toLowerCase()
-      })
-      .join(' ')
-  } else {
-    return ''
-  }
-}
+export function capitalLater(word: string): string {}
 
killedBy: isArrayOfStrings isArrayOfStrings("coca cola") should be Coca Cola
statusReason: expected undefined to be 'Coca Cola' // Object.is equality

[Killed] EqualityOperator
src/string/capitarLater.ts:2:7
 export function capitalLater(word: string): string {
-  if (typeof word === 'string') {
+  if (typeof word !== 'string') {
     const splittedString = word.split(' ')
     return splittedString
killedBy: isArrayOfStrings isArrayOfStrings("coca cola") should be Coca Cola
statusReason: expected '' to be 'Coca Cola' // Object.is equality

[Killed] BlockStatement
src/string/capitarLater.ts:2:33
 export function capitalLater(word: string): string {
-  if (typeof word === 'string') {
-    const splittedString = word.split(' ')
-    return splittedString
-      .map((str: string) => {
-        return str.charAt(0).toUpperCase() + str.slice(1).toLowerCase()
-      })
-      .join(' ')
-  } else {
+  if (typeof word === 'string') {} else {
     return ''
   }
killedBy: isArrayOfStrings isArrayOfStrings("coca cola") should be Coca Cola
statusReason: expected undefined to be 'Coca Cola' // Object.is equality

[Killed] BlockStatement
src/string/capitarLater.ts:5:29
   if (typeof word === 'string') {
     const splittedString = word.split(' ')
     return splittedString
-      .map((str: string) => {
-        return str.charAt(0).toUpperCase() + str.slice(1).toLowerCase()
-      })
+      .map((str: string) => {})
       .join(' ')
   } else {
killedBy: isArrayOfStrings isArrayOfStrings("coca cola") should be Coca Cola
statusReason: expected ' ' to be 'Coca Cola' // Object.is equality

[Killed] MethodExpression
src/string/capitarLater.ts:6:16
     const splittedString = word.split(' ')
     return splittedString
       .map((str: string) => {
-        return str.charAt(0).toUpperCase() + str.slice(1).toLowerCase()
+        return str.charAt(0).toLowerCase() + str.slice(1).toLowerCase()
       })
       .join(' ')
killedBy: isArrayOfStrings isArrayOfStrings("coca cola") should be Coca Cola
statusReason: expected 'coca cola' to be 'Coca Cola' // Object.is equality

[Killed] MethodExpression
src/string/capitarLater.ts:6:16
     const splittedString = word.split(' ')
     return splittedString
       .map((str: string) => {
-        return str.charAt(0).toUpperCase() + str.slice(1).toLowerCase()
+        return str.toUpperCase() + str.slice(1).toLowerCase()
       })
       .join(' ')
killedBy: isArrayOfStrings isArrayOfStrings("coca cola") should be Coca Cola
statusReason: expected 'COCAoca COLAola' to be 'Coca Cola' // Object.is equality

[Killed] BlockStatement
src/string/capitarLater.ts:9:10
         return str.charAt(0).toUpperCase() + str.slice(1).toLowerCase()
       })
       .join(' ')
-  } else {
-    return ''
-  }
+  } else {}
 }
 
killedBy: isArrayOfStrings isArrayOfStrings(1) should ""
statusReason: expected undefined to be '' // Object.is equality
